anaselhassanin/STM32_Traffic_Light/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Red_Light_Pin GPIO_PIN_0
#define Red_Light_GPIO_Port GPIOA
#define Yellow_Light_Pin GPIO_PIN_1
#define Yellow_Light_GPIO_Port GPIOA
#define Green_Light_Pin GPIO_PIN_2
#define Green_Light_GPIO_Port GPIOA
#define Button_Pin GPIO_PIN_0
#define Button_GPIO_Port GPIOB
#define LCD_RS_Pin GPIO_PIN_10
#define LCD_RS_GPIO_Port GPIOB
#define LCD_EN_Pin GPIO_PIN_11
#define LCD_EN_GPIO_Port GPIOB
#define LCD_d4_Pin GPIO_PIN_12
#define LCD_d4_GPIO_Port GPIOB
#define LCD_d5_Pin GPIO_PIN_13
#define LCD_d5_GPIO_Port GPIOB
#define LCD_d6_Pin GPIO_PIN_14
#define LCD_d6_GPIO_Port GPIOB
#define LCD_d7_Pin GPIO_PIN_15
#define LCD_d7_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
